Repository: power-captcha/integration-typo3
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# site.configuration.api_key
source: API Key (mandatory)
de: API-Key (erforderlich)

# site.configuration.api_key.description
source: Enter your POWER CAPTCHA API Key. You can find your API Key in the API Key Management on power-captcha.com.
de: Gib deinen POWER CAPTCHA API-Key ein. Den API-Key findest du im Mein Konto-Breich auf power-captcha.com.

# site.configuration.secret_key
source: Secret Key (mandatory)
de: Secret-Key (erforderlich)

# site.configuration.secret_key.description
source: Enter your POWER CAPTCHA Secret Key. You can find your Secret Key in the API Key Management on power-captcha.com.
de: Gib deinen POWER CAPTCHA Secret-Key ein. Den Secret-Key findest du im Mein Konto-Breich auf power-captcha.com.

# site.configuration.check_mode
source: Check mode (optional)
de: Prüfmodus (optional)

# site.configuration.check_mode.description
source: Configure the display of the widget and the behaviour of the security check. There are three options: • Automatic (default): The widget is always displayed and the security check is started automatically as soon as the form is filled in or after the corresponding field (e.g. user name or email address) has been filled in. A click on the checkbox in the widget is only necessary if it is required to solve a captcha. • Hidden: The widget is not displayed initially and the security check is started automatically as soon as the form is filled in or after the corresponding field (e.g. user name or e-mail address) has been filled in. The widget is only displayed if it is required to solve a captcha. • Manual: The widget is always displayed and the security check is only started when the checkbox in the widget is clicked.
de: Konfiguriere die Anzeige des Widgets und das Verhalten der Sicherheitsprüfung. Es gibt drei Optionen: • Automatisch (Standard): Das Widget wird immer angezeigt und die Sicherheitsprüfung wird automatisch gestartet, sobald das Formular ausgefüllt wird oder nachdem das entsprechende Feld (z.B. Benutzername oder E-Mail-Adresse) ausgefüllt wurde. Ein Klick auf die Checkbox im Widget ist nur notwendig, wenn ein Captcha gelöst werden muss. • Versteckt: Das Widget wird zunächst nicht angezeigt und die Sicherheitsprüfung wird automatisch gestartet, sobald das Formular ausgefüllt wird oder nachdem das entsprechende Feld (z. B. Benutzername oder E-Mail-Adresse) ausgefüllt wurde. Das Widget wird nur eingeblendet, wenn ein Captcha gelöst werden muss. • Manuell: Das Widget wird immer angezeigt, und die Sicherheitsprüfung wird erst gestartet, wenn auf die Checkbox im Widget geklickt wird.

# site.configuration.check_mode.item.auto
source: Automatic
de: Automatisch

# site.configuration.check_mode.item.hidden
source: Hidden
de: Versteckt

# site.configuration.check_mode.item.manu
source: Manual
de: Manuell

# site.configuration.endpoint_base_url
source: Endpoint base URL (optional)
de: Basis-URL des Endpunktes (optional)

# site.configuration.endpoint_base_url.description
source: Only needed if you have an on-premises version with self-hosted POWER CAPTCHA endpoint.
de: Nur erforderlich, wenn du eine On-Premises-Lösung mit selbst gehostetem POWER CAPTCHA Endpunkt hast.

# site.configuration.javascript_base_url
source: JavaScript base URL (optional)
de: JavaScript Basis-URL (optional)

# site.configuration.javascript_base_url.description
source: Only needed if you have an on-premises version with self-hosted POWER CAPTCHA JavaScript.
de: Nur erforderlich, wenn du eine On-Premises-Lösung mit selbst gehostetem POWER CAPTCHA-JavaScript hast.

# site.configuration.debug_mode
source: Debug mode (optional)
de: Debug-Modus (optional)

# site.configuration.debug_mode.description
source: Debug mode enables the log output in the browser console.
de: Der Debug-Modus aktiviert die Log-Ausgabe in der Browser-Konsole.

# message.blocked
source: Submission of the form was blocked by POWER CAPTCHA. Please try again later.
de: Das Absenden des Formulars wurde durch POWER CAPTCHA blockiert. Bitte versuche es später erneut.

# message.invalid
source: Security check must be confirmed!
de: Sicherheitsprüfung muss bestätigt werden!

# message.disabled_missing_configuration
source: Warning: POWER CAPTCHA is disabled due to missing configuration! Please configure POWER CAPTCHA or remove the field from this form.
de: Achtung: POWER CAPTCHA ist aufgrund einer fehlenden Konfiguration deaktiviert! Bitte konfiguriere POWER CAPTCHA oder entferne das Feld aus diesem Formular.

# message.error.no_token_field
source: The form does not contain a token field.
de: Das Formular enthält kein Token-Feld.

# message.error.token_not_verified
source: The token has not been verified.
de: Das Token ist leer.

# message.error.invalid_secret
source: The secret key is missing or invalid.
de: Der Secret-Key fehlt oder ist ungültig.

# message.error.invalid_token
source: The token is invalid.
de: Das Token ist ungültig.

# message.error.api_error
source: Error connecting to the API. API Key maybe invalid.
de: Fehler beim Verbinden mit der API. Der API-Key ist möglicherweise ungültig.
